Yezi23-boop/esp32-s3/components/audio_codec/audio_codec.c
/**
 * @file audio_codec.c
 * @brief 音频 codec 统一适配层实现
 * @details
 * - 控制面：通过 I2C 管理 ES8311/ES7210 寄存器
 * - 数据面：通过 I2S TX/RX 通道传输 PCM
 * - 对上层提供初始化、读写、音量、静音和增益控制接口
 */

#include <string.h>

#include "audio_codec_bus.h"
#include "audio_codec.h"
#include "audio_platform_config.h"
#include "driver/i2s_std.h"
#include "esp_codec_dev.h"
#include "esp_codec_dev_defaults.h"
#include "esp_idf_version.h"
#include "esp_log.h"
#include "es7210_adc.h"
#include "es8311_codec.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "i2c_manager.h"

static const char *TAG = "audio_codec";

static const audio_codec_ctrl_if_t *s_playback_ctrl_if = NULL; // ES8311 I2C 控制接口。
static const audio_codec_ctrl_if_t *s_record_ctrl_if = NULL;   // ES7210 I2C 控制接口。
static const audio_codec_gpio_if_t *s_gpio_if = NULL;          // 公共 GPIO 控制接口，负责 PA 等控制。
static const audio_codec_if_t *s_playback_codec_if = NULL;     // ES8311 codec 抽象接口。
static const audio_codec_if_t *s_record_codec_if = NULL;       // ES7210 codec 抽象接口。
static const audio_codec_data_if_t *s_data_if = NULL;          // I2S 数据接口。
static esp_codec_dev_handle_t s_playback_dev = NULL;           // 播放设备句柄。
static esp_codec_dev_handle_t s_record_dev = NULL;             // 录音设备句柄。

static int s_current_volume = 30;                                              // 当前缓存音量，范围为 0~100。
static int s_input_sample_rate = AUDIO_PLATFORM_HW_SAMPLE_RATE;                // 录音采样率，单位为 Hz。
static int s_output_sample_rate = AUDIO_PLATFORM_HW_SAMPLE_RATE;               // 播放采样率，单位为 Hz。
static int s_physical_rx_slots = 4;                                            // RX 物理时隙数，当前走 TDM。
static const char *s_logical_input_format = AUDIO_PLATFORM_ADC_CHANNEL_FORMAT; // 逻辑输入格式标签。
static int s_logical_input_channels = AUDIO_PLATFORM_HW_INPUT_CHANNELS;        // 逻辑输入通道数。
static bool s_input_reference = true;                                          // 是否包含参考通道。
static int s_output_channels = AUDIO_PLATFORM_HW_OUTPUT_CHANNELS;              // 输出通道数。
static int s_bits_per_sample = AUDIO_PLATFORM_HW_BITS_PER_SAMPLE;              // 采样位宽，单位为 bit。
static const uint8_t s_tx_silence_preload[2048] = {0};                         // TX flush 使用的静音预装缓冲。

static SemaphoreHandle_t s_resource_mutex = NULL;                       // 保护 codec 生命周期引用和会话 owner。
static uint32_t s_lifecycle_ref_count = 0;                               // 持有 audio_codec_init() 的模块数量。
static audio_codec_owner_t s_input_session_owner = AUDIO_CODEC_OWNER_SYSTEM;  // 当前独占录音链路的 owner。
static audio_codec_owner_t s_output_session_owner = AUDIO_CODEC_OWNER_SYSTEM; // 当前独占播放链路的 owner。
static bool s_input_session_active = false;                              // true 表示 I2S RX/ES7210 已被某个运行时占用。
static bool s_output_session_active = false;                             // true 表示 I2S TX/ES8311 已被某个播放者占用。

#define ES8311_CODEC_ADDR 0x30
#define ES7210_ADC_ADDR 0x80

static esp_err_t audio_codec_deinit_hardware_locked(void);

/**
 * @brief 返回音频 owner 的日志名称。
 *
 * @param[in] owner 音频资源申请者。
 * @return 静态字符串，便于在会话冲突时定位占用者。
 */
static const char *audio_codec_owner_name(audio_codec_owner_t owner)
{
    switch (owner)
    {
    case AUDIO_CODEC_OWNER_SYSTEM:
        return "system";
    case AUDIO_CODEC_OWNER_TRAFFIC_INFERENCE:
        return "traffic_inference";
    case AUDIO_CODEC_OWNER_ESPDL_INFERENCE:
        return "espdl_inference";
    case AUDIO_CODEC_OWNER_AUDIO_PLAYER:
        return "audio_player";
    case AUDIO_CODEC_OWNER_ALERT_PLAYER:
        return "alert_player";
    case AUDIO_CODEC_OWNER_AUDIO_RECORDER:
        return "audio_recorder";
    case AUDIO_CODEC_OWNER_OFFICIAL_CHAT:
        return "official_chat";
    case AUDIO_CODEC_OWNER_HERMES:
        return "hermes";
    default:
        return "unknown";
    }
}

const char *audio_codec_owner_to_text(audio_codec_owner_t owner)
{
    return audio_codec_owner_name(owner);
}

/**
 * @brief 确保音频资源 mutex 已创建。
 *
 * 该 mutex 是 audio_codec 的 owner 边界：生命周期引用计数、录音会话和播放会话
 * 都必须在同一把锁下修改，避免 UI/运行时任务交错 start/stop 时拆掉硬件资源。
 *
 * @return `ESP_OK` 表示 mutex 可用；`ESP_ERR_NO_MEM` 表示创建失败。
 */
static esp_err_t audio_codec_ensure_resource_mutex(void)
{
    if (s_resource_mutex != NULL)
    {
        return ESP_OK;
    }

    s_resource_mutex = xSemaphoreCreateMutex();
    if (s_resource_mutex == NULL)
    {
        ESP_LOGE(TAG, "Failed to create audio codec resource mutex");
        return ESP_ERR_NO_MEM;
    }
    return ESP_OK;
}

/**
 * @brief 按超时时间获取音频资源 mutex。
 *
 * @param[in] timeout_ms 等待时间，单位毫秒；`UINT32_MAX` 表示永久等待。
 * @return `ESP_OK` 表示已持锁。
 */
static esp_err_t audio_codec_lock_resources(uint32_t timeout_ms)
{
    esp_err_t ret = audio_codec_ensure_resource_mutex();
    if (ret != ESP_OK)
    {
        return ret;
    }

    const TickType_t ticks =
        timeout_ms == UINT32_MAX ? portMAX_DELAY : pdMS_TO_TICKS(timeout_ms);
    if (xSemaphoreTake(s_resource_mutex, ticks) != pdTRUE)
    {
        return ESP_ERR_TIMEOUT;
    }
    return ESP_OK;
}

/**
 * @brief 释放音频资源 mutex。
 */
static void audio_codec_unlock_resources(void)
{
    if (s_resource_mutex != NULL)
    {
        (void)xSemaphoreGive(s_resource_mutex);
    }
}

static int audio_codec_get_tx_slot_channels(void)
{
    // TX 至少按双声道时隙工作，避免单声道配置下的 slot 对齐问题。
    return s_output_channels > 1 ? s_output_channels : 2;
}

/**
 * @brief 判断当前输入通道顺序是否已满足逻辑层要求。
 * @return true 表示当前无需重排。
 */
static bool audio_codec_channel_order_is_identity(void)
{
    return true;
}

/**
 * @brief 将采样数据重排到逻辑输入格式。
 * @param[in,out] samples 采样数据缓冲区。
 * @param[in] sample_count 采样点数。
 * @return 无返回值。
 */
static void audio_codec_reorder_to_logical_input_format(int16_t *samples,
                                                        size_t sample_count)
{
    (void)samples;
    (void)sample_count;
    /* Keep the logical MR order stable here if runtime probing later shows
     * the selected RX slots are not already emitted as microphone/reference. */
}

/**
 * @brief 计算录音切片读取大小。
 * @return 建议的读取分片大小，单位为字节。
 */
static size_t audio_codec_get_read_slice_bytes(void)
{
    int bytes_per_sample = s_bits_per_sample / 8;
    size_t frame_bytes = 0;
    size_t bytes_per_tick = 0;

