Yezi23-boop/esp32-s3/components/audio_codec/audio_codec.c
    if (s_input_sample_rate <= 0 || s_logical_input_channels <= 0 ||
        bytes_per_sample <= 0)
    {
        return 1;
    }
    frame_bytes =
        (size_t)s_logical_input_channels * (size_t)bytes_per_sample;
    if (frame_bytes == 0)
    {
        return 1;
    }

    /* 保持有限等待语义，但不要把分片切得比一个 RTOS tick 还细。 */
    bytes_per_tick = (((size_t)s_input_sample_rate * frame_bytes) +
                      configTICK_RATE_HZ - 1) /
                     configTICK_RATE_HZ;
    if (bytes_per_tick < frame_bytes)
    {
        bytes_per_tick = frame_bytes;
    }
    return ((bytes_per_tick + frame_bytes - 1) / frame_bytes) * frame_bytes;
}

/**
 * @brief 计算 I2S TX flush 预装静音长度。
 * @return 建议的预装字节数。
 */
static size_t audio_codec_get_i2s_bus_preload_bytes(void)
{
    int bytes_per_sample = s_bits_per_sample / 8;
    size_t frame_bytes = 0;
    size_t bytes_per_tick = 0;

    if (s_output_sample_rate <= 0 || bytes_per_sample <= 0)
    {
        return 1;
    }

    frame_bytes =
        (size_t)audio_codec_get_tx_slot_channels() * (size_t)bytes_per_sample;
    if (frame_bytes == 0)
    {
        return 1;
    }

    bytes_per_tick =
        (((size_t)s_output_sample_rate * frame_bytes) + configTICK_RATE_HZ - 1) /
        configTICK_RATE_HZ;
    if (bytes_per_tick < frame_bytes)
    {
        bytes_per_tick = frame_bytes;
    }
    return ((bytes_per_tick + frame_bytes - 1) / frame_bytes) * frame_bytes;
}

/**
 * @brief 按切片和超时语义读取录音数据。
 * @param[in] dev 录音设备句柄。
 * @param[out] buffer 输出缓冲区。
 * @param[in] bytes 目标读取字节数。
 * @param[out] bytes_read 实际读取字节数。
 * @param[in] ticks_to_wait 最大等待 tick 数。
 * @param[in] slice_bytes 单次切片大小，单位为字节。
 * @return `ESP_OK` 表示读满；`ESP_ERR_TIMEOUT` 表示超时前仅拿到部分数据；其他错误表示底层读取失败。
 */
static esp_err_t audio_codec_read_with_timeout_slice(
    esp_codec_dev_handle_t dev, void *buffer, size_t bytes,
    size_t *bytes_read, TickType_t ticks_to_wait, size_t slice_bytes)
{
    TickType_t start_ticks = 0;
    size_t transferred = 0;

    if (bytes_read != NULL)
    {
        *bytes_read = 0;
    }
    if (dev == NULL)
    {
        return ESP_ERR_INVALID_STATE;
    }
    if (buffer == NULL && bytes > 0)
    {
        return ESP_ERR_INVALID_ARG;
    }
    if (bytes == 0)
    {
        return ESP_OK;
    }
    if (slice_bytes == 0)
    {
        slice_bytes = 1;
    }

    if (ticks_to_wait == portMAX_DELAY)
    {
        // 无限等待模式下，直接一次性读满目标长度，避免引入额外切片开销。
        int ret = esp_codec_dev_read(dev, buffer, (int)bytes);
        if (ret != ESP_CODEC_DEV_OK)
        {
            ESP_LOGW(TAG, "audio codec read failed: %d", ret);
            return ESP_FAIL;
        }
        if (bytes_read != NULL)
        {
            *bytes_read = bytes;
        }
        return ESP_OK;
    }

    start_ticks = xTaskGetTickCount();
    while (transferred < bytes)
    {
        size_t chunk_bytes = bytes - transferred; // 本轮计划读取字节数。
        int ret = 0;

        if ((xTaskGetTickCount() - start_ticks) >= ticks_to_wait &&
            transferred > 0)
        {
            break;
        }
        if (chunk_bytes > slice_bytes)
        {
            chunk_bytes = slice_bytes;
        }

        ret = esp_codec_dev_read(dev, (uint8_t *)buffer + transferred,
                                 (int)chunk_bytes);
        if (ret != ESP_CODEC_DEV_OK)
        {
            ESP_LOGW(TAG, "audio codec read failed: %d", ret);
            return ESP_FAIL;
        }

        transferred += chunk_bytes;
        if (transferred >= bytes)
        {
            break;
        }
        if (ticks_to_wait == 0 ||
            (xTaskGetTickCount() - start_ticks) >= ticks_to_wait)
        {
            break;
        }
    }

    if (bytes_read != NULL)
    {
        *bytes_read = transferred;
    }
    return transferred == bytes ? ESP_OK : ESP_ERR_TIMEOUT;
}

/**
 * @brief 初始化共享 I2C 总线。
 * @return `ESP_OK` 表示成功；其他错误表示总线初始化失败。
 */
static esp_err_t audio_i2c_init(void)
{
    return i2c_manager_init();
}

/**
 * @brief 创建复用共享 I2C 总线的 codec 控制接口。
 * @param[in] addr codec 地址。
 * @return 成功时返回控制接口对象；失败返回 NULL。
 */
static const audio_codec_ctrl_if_t *audio_codec_new_shared_i2c_ctrl(uint8_t addr)
{
    // addr 使用 codec 驱动约定的地址格式（与总线扫描显示风格可能不同）。
    audio_codec_i2c_cfg_t i2c_cfg = {
        .port = I2C_MANAGER_PORT,
        .addr = addr,
    };

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0)
    i2c_cfg.bus_handle = i2c_manager_get_bus_handle();
    if (i2c_cfg.bus_handle == NULL)
    {
        ESP_LOGE(TAG, "I2C master bus handle is NULL");
        return NULL;
    }
#endif

    return audio_codec_new_i2c_ctrl(&i2c_cfg);
}

/**
 * @brief 初始化默认控制接口和 GPIO 接口。
 * @return `ESP_OK` 表示成功；其他错误表示接口创建失败。
 */
static esp_err_t audio_codec_init_default_interfaces(void)
{
    s_playback_ctrl_if = audio_codec_new_shared_i2c_ctrl(ES8311_CODEC_ADDR);
    if (s_playback_ctrl_if == NULL)
    {
        ESP_LOGE(TAG, "Failed to create ES8311 I2C control interface");
        return ESP_FAIL;
    }

    s_record_ctrl_if = audio_codec_new_shared_i2c_ctrl(ES7210_ADC_ADDR);
    if (s_record_ctrl_if == NULL)
    {
        ESP_LOGE(TAG, "Failed to create ES7210 I2C control interface");
        return ESP_FAIL;
    }

    s_gpio_if = audio_codec_new_gpio();
    if (s_gpio_if == NULL)
    {
        ESP_LOGE(TAG, "Failed to create shared GPIO interface");
        return ESP_FAIL;
    }
    return ESP_OK;
}

/**
 * @brief 初始化 ES8311 播放链路。
 * @return `ESP_OK` 表示成功；其他错误表示 codec 创建或打开失败。
 */
static esp_err_t audio_es8311_init(void)
{
    // 播放链路采样参数决定 DAC 端 I2S 工作格式；这里必须和总线配置保持一致。
    esp_codec_dev_hw_gain_t hw_gain = {
        .pa_voltage = 5.0,
        .codec_dac_voltage = 3.3,
    };
    esp_codec_dev_sample_info_t sample_info = {
        .sample_rate = s_output_sample_rate,
        .channel = s_output_channels,
        .bits_per_sample = s_bits_per_sample,
    };

    if (s_playback_ctrl_if == NULL || s_gpio_if == NULL)
    {
        return ESP_ERR_INVALID_STATE;
    }

    s_playback_codec_if = es8311_codec_new(&(es8311_codec_cfg_t){
        .ctrl_if = s_playback_ctrl_if,
        .gpio_if = s_gpio_if,
        .codec_mode = ESP_CODEC_DEV_WORK_MODE_DAC,
        .pa_pin = AUDIO_PA_CTRL_GPIO,
        .pa_reverted = false,
        .master_mode = false,
        .use_mclk = true,
        .digital_mic = false,
        .invert_mclk = false,
        .invert_sclk = false,
        .hw_gain = hw_gain,
    });
    if (s_playback_codec_if == NULL)
    {
        ESP_LOGE(TAG, "Failed to create ES8311 codec");
        return ESP_FAIL;
    }

