Yezi23-boop/esp32-s3/components/audio_codec/audio_codec.c
    s_playback_dev = esp_codec_dev_new(&(esp_codec_dev_cfg_t){
        .codec_if = s_playback_codec_if,
        .data_if = s_data_if,
        .dev_type = ESP_CODEC_DEV_TYPE_OUT,
    });
    if (s_playback_dev == NULL ||
        esp_codec_dev_open(s_playback_dev, &sample_info) != ESP_CODEC_DEV_OK)
    {
        ESP_LOGE(TAG, "Failed to init ES8311");
        return ESP_FAIL;
    }

    esp_codec_dev_set_out_vol(s_playback_dev, s_current_volume);
    return ESP_OK;
}

/**
 * @brief 初始化 ES7210 录音链路。
 * @return `ESP_OK` 表示成功；其他错误表示 codec 创建或打开失败。
 */
static esp_err_t audio_es7210_init(void)
{
    // 录音链路里 `channel` 表示物理时隙数，`channel_mask` 决定真正采集哪些通道。
    esp_codec_dev_sample_info_t sample_info = {
        .sample_rate = s_input_sample_rate,
        .channel = s_physical_rx_slots,
        .channel_mask = ESP_CODEC_DEV_MAKE_CHANNEL_MASK(0),
        .bits_per_sample = s_bits_per_sample,
        .mclk_multiple = 0,
    };

    if (s_record_ctrl_if == NULL)
    {
        return ESP_ERR_INVALID_STATE;
    }

    if (s_input_reference)
    {
        sample_info.channel_mask |= ESP_CODEC_DEV_MAKE_CHANNEL_MASK(1);
    }

    s_record_codec_if = es7210_codec_new(&(es7210_codec_cfg_t){
        .ctrl_if = s_record_ctrl_if,
        .master_mode = false,
        .mic_selected = ES7210_SEL_MIC1 | ES7210_SEL_MIC2 | ES7210_SEL_MIC3 | ES7210_SEL_MIC4,
        .mclk_src = ES7210_MCLK_FROM_PAD,
    });
    if (s_record_codec_if == NULL)
    {
        ESP_LOGE(TAG, "Failed to create ES7210 codec");
        return ESP_FAIL;
    }

    s_record_dev = esp_codec_dev_new(&(esp_codec_dev_cfg_t){
        .codec_if = s_record_codec_if,
        .data_if = s_data_if,
        .dev_type = ESP_CODEC_DEV_TYPE_IN,
    });
    if (s_record_dev == NULL ||
        esp_codec_dev_open(s_record_dev, &sample_info) != ESP_CODEC_DEV_OK)
    {
        ESP_LOGE(TAG, "Failed to init ES7210");
        return ESP_FAIL;
    }

    esp_codec_dev_set_in_gain(s_record_dev, 36.0);
    return ESP_OK;
}

/**
 * @brief 执行真正的 codec 硬件初始化。
 *
 * 该函数只允许在持有 `s_resource_mutex` 且生命周期引用计数为 0 时调用。
 * 对外的 `audio_codec_init()` 负责幂等 retain，避免多个上层模块重复创建 I2S
 * 与 codec 对象。
 *
 * @return `ESP_OK` 表示成功；其他错误表示总线、控制接口或 codec 打开失败。
 */
static esp_err_t audio_codec_init_hardware_locked(void)
{
    esp_err_t ret;
    audio_codec_i2s_cfg_t i2s_cfg = {0};

    ret = audio_i2c_init();
    if (ret != ESP_OK)
    {
        return ret;
    }

    ret = audio_codec_bus_init();
    if (ret != ESP_OK)
    {
        return ret;
    }

    i2s_cfg.rx_handle = audio_codec_bus_get_rx_handle(); // 录音 RX 通道。
    i2s_cfg.tx_handle = audio_codec_bus_get_tx_handle(); // 播放 TX 通道。
    i2s_cfg.port = audio_codec_bus_get_port();           // 绑定 I2S 端口。
    if (i2s_cfg.rx_handle == NULL || i2s_cfg.tx_handle == NULL)
    {
        ret = ESP_ERR_INVALID_STATE;
        ESP_LOGE(TAG, "Audio codec bus handles are unavailable");
        goto init_failed;
    }

    s_data_if = audio_codec_new_i2s_data(&i2s_cfg);
    if (s_data_if == NULL)
    {
        ret = ESP_FAIL;
        ESP_LOGE(TAG, "Failed to create I2S data interface");
        goto init_failed;
    }

    ret = audio_codec_init_default_interfaces();
    if (ret != ESP_OK)
    {
        goto init_failed;
    }

    ret = audio_es8311_init();
    if (ret != ESP_OK)
    {
        goto init_failed;
    }

    ret = audio_es7210_init();
    if (ret != ESP_OK)
    {
        goto init_failed;
    }

    ESP_LOGI(TAG,
             "Audio codec ready: tx_mode=std rx_mode=tdm physical_rx_slots=%d "
             "logical_input_format=%s logical_input_channels=%d "
             "input_reference=%d in=%dHz/%dbit/%dch out=%dHz/%dbit/%dch",
             s_physical_rx_slots, s_logical_input_format,
             s_logical_input_channels, s_input_reference ? 1 : 0,
             s_input_sample_rate, s_bits_per_sample, s_logical_input_channels,
             s_output_sample_rate, s_bits_per_sample, s_output_channels);
    return ESP_OK;

init_failed:
    audio_codec_deinit_hardware_locked();
    return ret;
}

/**
 * @brief 反初始化真实 codec 硬件资源。
 *
 * 该函数只允许在持有 `s_resource_mutex` 且引用计数已经降到 0 时调用。
 * 它不会处理引用计数和会话 owner，只负责按安全顺序释放底层硬件对象。
 *
 * @return `ESP_OK` 表示成功。
 */
static esp_err_t audio_codec_deinit_hardware_locked(void)
{
    // 释放顺序遵循“先 device，再接口对象，再总线”，避免悬挂引用。
    if (s_playback_dev != NULL)
    {
        esp_codec_dev_close(s_playback_dev);
        esp_codec_dev_delete(s_playback_dev);
        s_playback_dev = NULL;
    }

    if (s_record_dev != NULL)
    {
        esp_codec_dev_close(s_record_dev);
        esp_codec_dev_delete(s_record_dev);
        s_record_dev = NULL;
    }

    if (s_playback_codec_if != NULL)
    {
        audio_codec_delete_codec_if(s_playback_codec_if);
        s_playback_codec_if = NULL;
    }

    if (s_record_codec_if != NULL)
    {
        audio_codec_delete_codec_if(s_record_codec_if);
        s_record_codec_if = NULL;
    }

    if (s_playback_ctrl_if != NULL)
    {
        audio_codec_delete_ctrl_if(s_playback_ctrl_if);
        s_playback_ctrl_if = NULL;
    }

    if (s_record_ctrl_if != NULL)
    {
        audio_codec_delete_ctrl_if(s_record_ctrl_if);
        s_record_ctrl_if = NULL;
    }

    if (s_gpio_if != NULL)
    {
        audio_codec_delete_gpio_if(s_gpio_if);
        s_gpio_if = NULL;
    }

    if (s_data_if != NULL)
    {
        audio_codec_delete_data_if(s_data_if);
        s_data_if = NULL;
    }

    (void)audio_codec_bus_deinit();

    ESP_LOGI(TAG, "Audio codec deinitialized");
    return ESP_OK;
}

/**
 * @brief 初始化音频 codec 子系统并持有一次生命周期引用。
 *
 * 该接口是幂等 retain：第一次调用真正打开 ES8311/ES7210/I2S，后续调用只增加
 * 引用计数。这样危险识别、语音、播放等模块可以独立 start/stop，不会互相拆掉
 * 全局音频硬件。
 *
 * @return `ESP_OK` 表示成功；其他错误表示 mutex、总线、控制接口或 codec 打开失败。
 */
esp_err_t audio_codec_init(void)
{
    esp_err_t ret = audio_codec_lock_resources(UINT32_MAX);
    if (ret != ESP_OK)
    {
        return ret;
    }

    if (s_lifecycle_ref_count > 0)
    {
        s_lifecycle_ref_count++;
        ESP_LOGD(TAG, "Audio codec retain: refs=%lu",
                 (unsigned long)s_lifecycle_ref_count);
        audio_codec_unlock_resources();
        return ESP_OK;
    }

