Yezi23-boop/esp32-s3/components/audio_codec/audio_codec.c
    ret = audio_codec_init_hardware_locked();
    if (ret == ESP_OK)
    {
        s_lifecycle_ref_count = 1;
        ESP_LOGI(TAG, "Audio codec retain: refs=%lu",
                 (unsigned long)s_lifecycle_ref_count);
    }
    audio_codec_unlock_resources();
    return ret;
}

/**
 * @brief 释放一次音频 codec 生命周期引用。
 *
 * 引用计数归零后才真正释放硬件；如果仍有录音或播放会话占用，返回
 * `ESP_ERR_INVALID_STATE`，避免在活跃 I2S 传输中关闭 codec。
 *
 * @return `ESP_OK` 表示释放成功；其他错误表示引用计数异常或仍有会话占用。
 */
esp_err_t audio_codec_deinit(void)
{
    esp_err_t ret = audio_codec_lock_resources(UINT32_MAX);
    if (ret != ESP_OK)
    {
        return ret;
    }

    if (s_lifecycle_ref_count == 0)
    {
        audio_codec_unlock_resources();
        return ESP_OK;
    }

    s_lifecycle_ref_count--;
    ESP_LOGD(TAG, "Audio codec release: refs=%lu",
             (unsigned long)s_lifecycle_ref_count);
    if (s_lifecycle_ref_count > 0)
    {
        audio_codec_unlock_resources();
        return ESP_OK;
    }

    if (s_input_session_active || s_output_session_active)
    {
        s_lifecycle_ref_count = 1;
        ESP_LOGW(TAG,
                 "Refuse to deinit audio codec while sessions are active: "
                 "input=%s(%d), output=%s(%d)",
                 audio_codec_owner_name(s_input_session_owner),
                 s_input_session_active ? 1 : 0,
                 audio_codec_owner_name(s_output_session_owner),
                 s_output_session_active ? 1 : 0);
        audio_codec_unlock_resources();
        return ESP_ERR_INVALID_STATE;
    }

    ret = audio_codec_deinit_hardware_locked();
    audio_codec_unlock_resources();
    return ret;
}

/**
 * @brief 通用申请音频独占会话。
 *
 * @param[in,out] active 会话激活标志。
 * @param[in,out] current_owner 当前 owner 存储。
 * @param[in] owner 申请者。
 * @param[in] timeout_ms 等待互斥锁的超时，单位毫秒。
 * @param[in] session_name 日志中的会话名称。
 * @return `ESP_OK` 表示获得会话。
 */
static esp_err_t audio_codec_acquire_session(bool *active,
                                             audio_codec_owner_t *current_owner,
                                             audio_codec_owner_t owner,
                                             uint32_t timeout_ms,
                                             const char *session_name)
{
    bool busy_logged = false; // 避免等待期间反复刷屏，只记录第一次 owner 冲突。
    const TickType_t start_ticks = xTaskGetTickCount();
    TickType_t timeout_ticks =
        timeout_ms == UINT32_MAX ? portMAX_DELAY : pdMS_TO_TICKS(timeout_ms);

    if (active == NULL || current_owner == NULL || session_name == NULL)
    {
        return ESP_ERR_INVALID_ARG;
    }
    if (timeout_ms > 0U && timeout_ms != UINT32_MAX && timeout_ticks == 0)
    {
        timeout_ticks = 1;
    }

    while (true)
    {
        uint32_t lock_timeout_ms = 0U; // 本轮等待 mutex 的时间，仍受总 timeout 约束。
        if (timeout_ms == UINT32_MAX)
        {
            lock_timeout_ms = UINT32_MAX;
        }
        else if (timeout_ms > 0U)
        {
            const TickType_t elapsed = xTaskGetTickCount() - start_ticks;
            const TickType_t remaining_ticks =
                elapsed < timeout_ticks ? timeout_ticks - elapsed : 0;
            lock_timeout_ms =
                ((uint32_t)remaining_ticks * 1000U) / configTICK_RATE_HZ + 1U;
        }

        esp_err_t ret = audio_codec_lock_resources(lock_timeout_ms);
        if (ret != ESP_OK)
        {
            return ret;
        }

        if (s_lifecycle_ref_count == 0 || s_record_dev == NULL ||
            s_playback_dev == NULL)
        {
            audio_codec_unlock_resources();
            return ESP_ERR_INVALID_STATE;
        }

        if (!*active)
        {
            *active = true;
            *current_owner = owner;
            ESP_LOGI(TAG, "%s session acquired by %s",
                     session_name, audio_codec_owner_name(owner));
            audio_codec_unlock_resources();
            return ESP_OK;
        }

        if (!busy_logged)
        {
            busy_logged = true;
            ESP_LOGW(TAG, "%s session busy: owner=%s, requester=%s",
                     session_name, audio_codec_owner_name(*current_owner),
                     audio_codec_owner_name(owner));
        }
        audio_codec_unlock_resources();

        if (timeout_ms == 0U)
        {
            return ESP_ERR_TIMEOUT;
        }

        TickType_t delay_ticks = pdMS_TO_TICKS(10U);
        if (delay_ticks == 0)
        {
            delay_ticks = 1;
        }
        if (timeout_ms != UINT32_MAX)
        {
            const TickType_t elapsed = xTaskGetTickCount() - start_ticks;
            if (elapsed >= timeout_ticks)
            {
                return ESP_ERR_TIMEOUT;
            }
            const TickType_t remaining_ticks = timeout_ticks - elapsed;
            if (delay_ticks > remaining_ticks)
            {
                delay_ticks = remaining_ticks;
            }
        }
        vTaskDelay(delay_ticks);
    }
}

/**
 * @brief 通用释放音频独占会话。
 *
 * @param[in,out] active 会话激活标志。
 * @param[in,out] current_owner 当前 owner 存储。
 * @param[in] owner 释放者。
 * @param[in] session_name 日志中的会话名称。
 * @return `ESP_OK` 表示释放成功。
 */
static esp_err_t audio_codec_release_session(bool *active,
                                             audio_codec_owner_t *current_owner,
                                             audio_codec_owner_t owner,
                                             const char *session_name)
{
    if (active == NULL || current_owner == NULL || session_name == NULL)
    {
        return ESP_ERR_INVALID_ARG;
    }

    esp_err_t ret = audio_codec_lock_resources(UINT32_MAX);
    if (ret != ESP_OK)
    {
        return ret;
    }

    if (!*active)
    {
        audio_codec_unlock_resources();
        return ESP_ERR_INVALID_STATE;
    }
    if (*current_owner != owner)
    {
        ESP_LOGW(TAG, "%s session release owner mismatch: owner=%s, requester=%s",
                 session_name, audio_codec_owner_name(*current_owner),
                 audio_codec_owner_name(owner));
        audio_codec_unlock_resources();
        return ESP_ERR_INVALID_STATE;
    }

    *active = false;
    *current_owner = AUDIO_CODEC_OWNER_SYSTEM;
    ESP_LOGI(TAG, "%s session released by %s",
             session_name, audio_codec_owner_name(owner));
    audio_codec_unlock_resources();
    return ESP_OK;
}

/**
 * @brief 申请独占录音输入会话。
 *
 * @param[in] owner 申请者标识。
 * @param[in] timeout_ms 等待已有 owner 释放的超时，单位毫秒；0 表示不等待。
 * @return `ESP_OK` 表示获得会话。
 */
esp_err_t audio_codec_acquire_input(audio_codec_owner_t owner,
                                    uint32_t timeout_ms)
{
    return audio_codec_acquire_session(&s_input_session_active,
                                       &s_input_session_owner,
                                       owner, timeout_ms, "input");
}

/**
 * @brief 释放独占录音输入会话。
 *
 * @param[in] owner 释放者标识。
 * @return `ESP_OK` 表示释放成功。
 */
esp_err_t audio_codec_release_input(audio_codec_owner_t owner)
{
    return audio_codec_release_session(&s_input_session_active,
                                       &s_input_session_owner,
                                       owner, "input");
}

/**
 * @brief 申请独占播放输出会话。
 *
 * @param[in] owner 申请者标识。
 * @param[in] timeout_ms 等待已有 owner 释放的超时，单位毫秒；0 表示不等待。
 * @return `ESP_OK` 表示获得会话。
 */
esp_err_t audio_codec_acquire_output(audio_codec_owner_t owner,
                                     uint32_t timeout_ms)
{
    return audio_codec_acquire_session(&s_output_session_active,
                                       &s_output_session_owner,
                                       owner, timeout_ms, "output");
}

/**
 * @brief 释放独占播放输出会话。
 *
 * @param[in] owner 释放者标识。
 * @return `ESP_OK` 表示释放成功。
 */
esp_err_t audio_codec_release_output(audio_codec_owner_t owner)
{
    return audio_codec_release_session(&s_output_session_active,
                                       &s_output_session_owner,
                                       owner, "output");
}

esp_err_t audio_codec_get_session_snapshot(
    audio_codec_session_snapshot_t *snapshot)
{
    if (snapshot == NULL)
    {
        return ESP_ERR_INVALID_ARG;
    }

    esp_err_t ret = audio_codec_lock_resources(UINT32_MAX);
    if (ret != ESP_OK)
    {
        return ret;
    }

    snapshot->input_active = s_input_session_active;
    snapshot->input_owner = s_input_session_owner;
    snapshot->output_active = s_output_session_active;
    snapshot->output_owner = s_output_session_owner;

