Yezi23-boop/esp32-s3/components/audio_codec/audio_codec.c
    audio_codec_unlock_resources();
    return ESP_OK;
}

/**
 * @brief 从录音链路读取 PCM 数据。
 * @param[out] buffer 接收缓冲区。
 * @param[in] bytes 目标读取字节数。
 * @param[out] bytes_read 实际读取字节数，可为 NULL。
 * @param[in] ticks_to_wait 最大等待 tick 数。
 * @return `ESP_OK` 表示成功；`ESP_ERR_TIMEOUT` 表示超时前仅拿到部分数据；其他错误表示底层读取失败。
 */
esp_err_t audio_codec_read(void *buffer, size_t bytes, size_t *bytes_read,
                           TickType_t ticks_to_wait)
{
    TickType_t start_ticks = xTaskGetTickCount();
    esp_err_t ret = audio_codec_read_with_timeout_slice(
        s_record_dev, buffer, bytes, bytes_read, ticks_to_wait,
        audio_codec_get_read_slice_bytes());
    size_t actual_bytes = bytes_read != NULL ? *bytes_read : bytes; // 实际读取长度。

    if (ret == ESP_OK && buffer != NULL &&
        !audio_codec_channel_order_is_identity())
    {
        audio_codec_reorder_to_logical_input_format(
            (int16_t *)buffer, actual_bytes / sizeof(int16_t));
    }

    ESP_LOGD(TAG,
             "read target=%u actual=%u elapsed_ticks=%lu wait_ticks=%lu ret=%s",
             (unsigned int)bytes,
             (unsigned int)actual_bytes,
             (unsigned long)(xTaskGetTickCount() - start_ticks),
             (unsigned long)ticks_to_wait, esp_err_to_name(ret));
    return ret;
}

/**
 * @brief 向播放链路写入 PCM 数据。
 * @param[in] buffer PCM 数据地址。
 * @param[in] bytes 待写入字节数。
 * @return `ESP_OK` 表示成功；其他错误表示参数非法或底层写入失败。
 */
esp_err_t audio_codec_write(const void *buffer, size_t bytes)
{
    if (s_playback_dev == NULL)
    {
        return ESP_ERR_INVALID_STATE;
    }
    if (buffer == NULL && bytes > 0)
    {
        return ESP_ERR_INVALID_ARG;
    }
    if (bytes == 0)
    {
        return ESP_OK;
    }

    if (esp_codec_dev_write(s_playback_dev, (void *)buffer, (int)bytes) !=
        ESP_CODEC_DEV_OK)
    {
        ESP_LOGW(TAG, "audio codec write failed");
        return ESP_FAIL;
    }
    return ESP_OK;
}

/**
 * @brief 通过预装静音数据刷新 TX 通道。
 * @return `ESP_OK` 表示成功；其他错误表示底层 I2S 预装失败。
 */
esp_err_t audio_codec_flush_output(void)
{
    esp_err_t ret = ESP_OK;
    i2s_chan_handle_t tx_handle = audio_codec_bus_get_tx_handle(); // TX 通道句柄。
    size_t preload_bytes = 0;                                      // 计划预装静音字节数。
    size_t bytes_loaded = 0;                                       // 实际预装成功字节数。

    if (tx_handle == NULL)
    {
        return ESP_ERR_INVALID_STATE;
    }

    preload_bytes = audio_codec_get_i2s_bus_preload_bytes();
    if (preload_bytes > sizeof(s_tx_silence_preload))
    {
        preload_bytes = sizeof(s_tx_silence_preload);
    }

    ret = i2s_channel_disable(tx_handle);
    if (ret != ESP_OK)
    {
        ESP_LOGW(TAG, "failed to disable I2S TX for flush: %s",
                 esp_err_to_name(ret));
        return ret;
    }

    ret = i2s_channel_preload_data(tx_handle, s_tx_silence_preload,
                                   preload_bytes, &bytes_loaded);
    if (ret != ESP_OK)
    {
        ESP_LOGW(TAG, "failed to preload silence for I2S TX flush: %s",
                 esp_err_to_name(ret));
        (void)i2s_channel_enable(tx_handle);
        return ret;
    }

    ret = i2s_channel_enable(tx_handle);
    if (ret != ESP_OK)
    {
        ESP_LOGW(TAG, "failed to enable I2S TX after flush: %s",
                 esp_err_to_name(ret));
        return ret;
    }
    if (bytes_loaded == 0)
    {
        ESP_LOGW(TAG, "no silence bytes were preloaded during TX flush");
        return ESP_FAIL;
    }

    return ESP_OK;
}

/**
 * @brief 设置播放音量。
 * @param[in] volume 音量百分比，范围为 0~100。
 * @return `ESP_OK` 表示成功；其他错误表示参数非法或底层设置失败。
 */
esp_err_t audio_codec_set_volume(int volume)
{
    if (s_playback_dev == NULL || volume < 0 || volume > 100)
    {
        return ESP_ERR_INVALID_ARG;
    }
    if (esp_codec_dev_set_out_vol(s_playback_dev, volume) != ESP_CODEC_DEV_OK)
    {
        return ESP_FAIL;
    }
    s_current_volume = volume;
    return ESP_OK;
}

/**
 * @brief 获取当前缓存音量。
 * @param[out] volume 输出参数，返回 0~100。
 * @return `ESP_OK` 表示成功；其他错误表示参数非法或播放设备未就绪。
 */
esp_err_t audio_codec_get_volume(int *volume)
{
    if (s_playback_dev == NULL || volume == NULL)
    {
        return ESP_ERR_INVALID_ARG;
    }
    *volume = s_current_volume;
    return ESP_OK;
}

/**
 * @brief 设置播放静音状态。
 * @param[in] enable true 表示静音。
 * @return `ESP_OK` 表示成功；其他错误表示播放设备未就绪或底层设置失败。
 */
esp_err_t audio_codec_set_mute(bool enable)
{
    if (s_playback_dev == NULL)
    {
        return ESP_ERR_INVALID_STATE;
    }
    return esp_codec_dev_set_out_mute(s_playback_dev, enable) ==
                   ESP_CODEC_DEV_OK
               ? ESP_OK
               : ESP_FAIL;
}

/**
 * @brief 控制外部功放使能引脚。
 * @param[in] enable true 表示打开功放。
 * @return `ESP_OK` 表示成功；其他错误表示 GPIO 控制接口未就绪或底层设置失败。
 */
esp_err_t audio_codec_set_pa_enable(bool enable)
{
    if (s_gpio_if == NULL)
    {
        return ESP_ERR_INVALID_STATE;
    }
    return s_gpio_if->set(AUDIO_PA_CTRL_GPIO, enable) == ESP_CODEC_DEV_OK
               ? ESP_OK
               : ESP_FAIL;
}

/**
 * @brief 设置录音增益。
 * @param[in] db 目标增益，单位为 dB。
 * @return `ESP_OK` 表示成功；其他错误表示录音设备未就绪或底层设置失败。
 */
esp_err_t audio_codec_set_record_gain(float db)
{
    if (s_record_dev == NULL)
    {
        return ESP_ERR_INVALID_STATE;
    }
    return esp_codec_dev_set_in_gain(s_record_dev, db) == ESP_CODEC_DEV_OK
               ? ESP_OK
               : ESP_FAIL;
}
